Revit 2015 API
ViewSheet.SetAdditionalProjectRevisionIds Method
 Sets the Revisions to additionally include in the sheet's revision schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use SetAdditionalRevisionIds(ICollection<ElementId^>) instead.")]
public void SetAdditionalProjectRevisionIds(
	ICollection<ElementId> projectRevisionIds
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use SetAdditionalRevisionIds(ICollection<ElementId^>) instead.")> _
Public Sub SetAdditionalProjectRevisionIds ( _
	projectRevisionIds As ICollection(Of ElementId) _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use SetAdditionalRevisionIds(ICollection<ElementId^>) instead.")]
public:
void SetAdditionalProjectRevisionIds(
	ICollection<ElementId^>^ projectRevisionIds
)
Parameters
projectRevisionIds
Type: System.Collections.Generic.ICollection<ElementId>
 The ids of Revisions to explicitly include in the sheet's revision schedules.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One or more ElementIds in projectRevisionIds do not correspond to a Revision element.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace